Tekla.Structures.DialogInternal.CDelegateSynchronized
Provides akit synchronization to CDialogDelegate.

Tekla.Structures.DialogInternal.CDelegateSynchronized.#ctor
Constructor for the synchronization object

Tekla.Structures.DialogInternal.CDelegateSynchronized.InvokeRequired
Are we already running in a-kit thread?

Tekla.Structures.DialogInternal.CDelegateSynchronized.BeginInvoke(System.Delegate,System.Object[])
Begininvoke starts the function call

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(System.IAsyncResult)
Endinvoke waits for the call to finnish.

Tekla.Structures.DialogInternal.CDelegateSynchronized.Invoke(System.Delegate,System.Object[])
Invoke begins and ends the call.

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(System.IntPtr@,System.String,System.IAsyncResult)
Get Akit mainframe handle

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(System.Int32,System.IAsyncResult)
Int parameter

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(System.String,System.IAsyncResult)
String parameter

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(System.Text.StringBuilder,System.IAsyncResult)
StringBuilder parameter

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t@,System.IAsyncResult)
AttributeDefinition parameter

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(System.String,System.Text.StringBuilder,System.IAsyncResult)
String and StringBuilder parameters

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(System.String,Tekla.Structures.DialogInternal.dotdiaAttributeValue_t@,System.IAsyncResult)
String and AttributeValue parameters

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.DialogInternal.dotdiaSettings_t@,System.IAsyncResult)
Settings parameter

Tekla.Structures.DialogInternal.CDelegateSynchronized.EndInvoke(Tekla.Structures.DialogInternal.dotdiaProfile_t@,System.IAsyncResult)
Profile parameter

Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportAddExternalWindow(System.String,System.IntPtr)
Register window to AKIT.

Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportRemoveExternalWindow(System.String,System.IntPtr)
Unregisters window to AKIT.

Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportRegisterDialog(System.String)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetModelPath(System.String@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportAddAttribute(Tekla.Structures.DialogInternal.dotdiaAttributeDefinition_t@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportStoreAppliedValues(System.String)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetCB


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportModifyCB


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportFindAttributeFile(System.String,System.String@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportSetActiveDialog(System.String)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportSetDialogToggles(System.Int32)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportSetDialogValue(System.String,Tekla.Structures.DialogInternal.dotdiaAttributeValue_t@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetDialogValue(System.String,Tekla.Structures.DialogInternal.dotdiaAttributeValue_t@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetUnitDecimals(Tekla.Structures.Dialog.dotdiaUnitTypes_e)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetSettings(Tekla.Structures.DialogInternal.dotdiaSettings_t@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetActiveDialog(System.String@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportAddAttributeToStack(System.String,Tekla.Structures.DialogInternal.dotdiaAttributeValue_t@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetAttributeFileName(System.String@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportConvertFromCurrentUnits(Tekla.Structures.DialogInternal.dotdiaProfile_t@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportConvertToCurrentUnits(Tekla.Structures.DialogInternal.dotdiaProfile_t@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportAddAkitForm(Tekla.Technology.Akit.IAkitForm@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportRemoveAkitForm(Tekla.Technology.Akit.IAkitForm@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ExportGetMainFrameHandle(System.Int32@)


Tekla.Structures.DialogInternal.CDelegateSynchronized.LoadAttributeFileNameToDialogAndApply(System.String,System.String)


Tekla.Structures.DialogInternal.CDelegateSynchronized.LoadAttributeFileNameToDialogAndModify(System.String,System.String)


Tekla.Structures.DialogInternal.CDelegateSynchronized.DisplayHtmlHelpTopic(System.String)


Tekla.Structures.DialogInternal.CDelegateSynchronized.RegisterObjectDialogAttributeCallback(Tekla.Structures.DialogInternal.RebarAttibuteCallback_t)


Tekla.Structures.DialogInternal.CDelegateSynchronized.RegisterShapeObjectDialogAttributeCallback(Tekla.Structures.DialogInternal.ShapeAttibuteCallback_t)


Tekla.Structures.DialogInternal.CDelegateSynchronized.ProcessValueChangedEvent(System.IntPtr,System.String)


Tekla.Structures.DialogInternal.CDelegateSynchronized.FreeDialogOwnerHandle(System.IntPtr@)
